espressif/esp-idf/components/soc/esp32s31/register/soc/lp_apm_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LP_APM_REGION_FILTER_EN_REG register
 *  Region filter enable register
 */
#define LP_APM_REGION_FILTER_EN_REG (DR_REG_LP_APM_BASE + 0x0)
/** LP_APM_REGION_FILTER_EN : R/W; bitpos: [7:0]; default: 1;
 *  Configure bit $n(0-7) to enable region $n.
 *  0: disable
 *  1: enable
 */
#define LP_APM_REGION_FILTER_EN    0x000000FFU
#define LP_APM_REGION_FILTER_EN_M  (LP_APM_REGION_FILTER_EN_V << LP_APM_REGION_FILTER_EN_S)
#define LP_APM_REGION_FILTER_EN_V  0x000000FFU
#define LP_APM_REGION_FILTER_EN_S  0

/** LP_APM_REGION0_ADDR_START_REG register
 *  Region address register
 */
#define LP_APM_REGION0_ADDR_START_REG (DR_REG_LP_APM_BASE + 0x4)
/** LP_APM_REGION0_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures start address of region 0
 */
#define LP_APM_REGION0_ADDR_START    0xFFFFFFFFU
#define LP_APM_REGION0_ADDR_START_M  (LP_APM_REGION0_ADDR_START_V << LP_APM_REGION0_ADDR_START_S)
#define LP_APM_REGION0_ADDR_START_V  0xFFFFFFFFU
#define LP_APM_REGION0_ADDR_START_S  0

/** LP_APM_REGION0_ADDR_END_REG register
 *  Region address register
 */
#define LP_APM_REGION0_ADDR_END_REG (DR_REG_LP_APM_BASE + 0x8)
/** LP_APM_REGION0_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures end address of region 0
 */
#define LP_APM_REGION0_ADDR_END    0xFFFFFFFFU
#define LP_APM_REGION0_ADDR_END_M  (LP_APM_REGION0_ADDR_END_V << LP_APM_REGION0_ADDR_END_S)
#define LP_APM_REGION0_ADDR_END_V  0xFFFFFFFFU
#define LP_APM_REGION0_ADDR_END_S  0

/** LP_APM_REGION0_ATTR_REG register
 *  Region access authority attribute register
 */
#define LP_APM_REGION0_ATTR_REG (DR_REG_LP_APM_BASE + 0xc)
/** LP_APM_REGION0_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 0.
 */
#define LP_APM_REGION0_R0_X    (BIT(0))
#define LP_APM_REGION0_R0_X_M  (LP_APM_REGION0_R0_X_V << LP_APM_REGION0_R0_X_S)
#define LP_APM_REGION0_R0_X_V  0x00000001U
#define LP_APM_REGION0_R0_X_S  0
/** LP_APM_REGION0_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 0.
 */
#define LP_APM_REGION0_R0_W    (BIT(1))
#define LP_APM_REGION0_R0_W_M  (LP_APM_REGION0_R0_W_V << LP_APM_REGION0_R0_W_S)
#define LP_APM_REGION0_R0_W_V  0x00000001U
#define LP_APM_REGION0_R0_W_S  1
/** LP_APM_REGION0_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 0.
 */
#define LP_APM_REGION0_R0_R    (BIT(2))
#define LP_APM_REGION0_R0_R_M  (LP_APM_REGION0_R0_R_V << LP_APM_REGION0_R0_R_S)
#define LP_APM_REGION0_R0_R_V  0x00000001U
#define LP_APM_REGION0_R0_R_S  2
/** LP_APM_REGION0_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 0.
 */
#define LP_APM_REGION0_R1_X    (BIT(4))
#define LP_APM_REGION0_R1_X_M  (LP_APM_REGION0_R1_X_V << LP_APM_REGION0_R1_X_S)
#define LP_APM_REGION0_R1_X_V  0x00000001U
#define LP_APM_REGION0_R1_X_S  4
/** LP_APM_REGION0_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 0.
 */
#define LP_APM_REGION0_R1_W    (BIT(5))
#define LP_APM_REGION0_R1_W_M  (LP_APM_REGION0_R1_W_V << LP_APM_REGION0_R1_W_S)
#define LP_APM_REGION0_R1_W_V  0x00000001U
#define LP_APM_REGION0_R1_W_S  5
/** LP_APM_REGION0_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 0.
 */
#define LP_APM_REGION0_R1_R    (BIT(6))
#define LP_APM_REGION0_R1_R_M  (LP_APM_REGION0_R1_R_V << LP_APM_REGION0_R1_R_S)
#define LP_APM_REGION0_R1_R_V  0x00000001U
#define LP_APM_REGION0_R1_R_S  6
/** LP_APM_REGION0_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 0.
 */
#define LP_APM_REGION0_R2_X    (BIT(8))
#define LP_APM_REGION0_R2_X_M  (LP_APM_REGION0_R2_X_V << LP_APM_REGION0_R2_X_S)
#define LP_APM_REGION0_R2_X_V  0x00000001U
#define LP_APM_REGION0_R2_X_S  8
/** LP_APM_REGION0_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 0.
 */
#define LP_APM_REGION0_R2_W    (BIT(9))
#define LP_APM_REGION0_R2_W_M  (LP_APM_REGION0_R2_W_V << LP_APM_REGION0_R2_W_S)
#define LP_APM_REGION0_R2_W_V  0x00000001U
#define LP_APM_REGION0_R2_W_S  9
/** LP_APM_REGION0_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 0.
 */
#define LP_APM_REGION0_R2_R    (BIT(10))
#define LP_APM_REGION0_R2_R_M  (LP_APM_REGION0_R2_R_V << LP_APM_REGION0_R2_R_S)
#define LP_APM_REGION0_R2_R_V  0x00000001U
#define LP_APM_REGION0_R2_R_S  10
/** LP_APM_REGION0_TEE_X : R/W; bitpos: [12]; default: 1;
 *  Configures the execution authority of TEE_MODE in region 0.
 */
#define LP_APM_REGION0_TEE_X    (BIT(12))
#define LP_APM_REGION0_TEE_X_M  (LP_APM_REGION0_TEE_X_V << LP_APM_REGION0_TEE_X_S)
#define LP_APM_REGION0_TEE_X_V  0x00000001U
#define LP_APM_REGION0_TEE_X_S  12
/** LP_APM_REGION0_TEE_W : R/W; bitpos: [13]; default: 1;
 *  Configures the write authority of TEE_MODE in region 0.
 */
#define LP_APM_REGION0_TEE_W    (BIT(13))
#define LP_APM_REGION0_TEE_W_M  (LP_APM_REGION0_TEE_W_V << LP_APM_REGION0_TEE_W_S)
#define LP_APM_REGION0_TEE_W_V  0x00000001U
#define LP_APM_REGION0_TEE_W_S  13
/** LP_APM_REGION0_TEE_R : R/W; bitpos: [14]; default: 1;
 *  Configures the read authority of TEE_MODE in region 0.
 */
#define LP_APM_REGION0_TEE_R    (BIT(14))
#define LP_APM_REGION0_TEE_R_M  (LP_APM_REGION0_TEE_R_V << LP_APM_REGION0_TEE_R_S)
#define LP_APM_REGION0_TEE_R_V  0x00000001U
#define LP_APM_REGION0_TEE_R_S  14
/** LP_APM_REGION0_LOCK : R/W; bitpos: [16]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define LP_APM_REGION0_LOCK    (BIT(16))
#define LP_APM_REGION0_LOCK_M  (LP_APM_REGION0_LOCK_V << LP_APM_REGION0_LOCK_S)
#define LP_APM_REGION0_LOCK_V  0x00000001U
#define LP_APM_REGION0_LOCK_S  16

/** LP_APM_REGION1_ADDR_START_REG register
 *  Region address register
 */
#define LP_APM_REGION1_ADDR_START_REG (DR_REG_LP_APM_BASE + 0x10)
/** LP_APM_REGION1_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures start address of region 1
 */
#define LP_APM_REGION1_ADDR_START    0xFFFFFFFFU
#define LP_APM_REGION1_ADDR_START_M  (LP_APM_REGION1_ADDR_START_V << LP_APM_REGION1_ADDR_START_S)
#define LP_APM_REGION1_ADDR_START_V  0xFFFFFFFFU
#define LP_APM_REGION1_ADDR_START_S  0

/** LP_APM_REGION1_ADDR_END_REG register
 *  Region address register
 */
#define LP_APM_REGION1_ADDR_END_REG (DR_REG_LP_APM_BASE + 0x14)
/** LP_APM_REGION1_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures end address of region 1
 */
#define LP_APM_REGION1_ADDR_END    0xFFFFFFFFU
#define LP_APM_REGION1_ADDR_END_M  (LP_APM_REGION1_ADDR_END_V << LP_APM_REGION1_ADDR_END_S)
#define LP_APM_REGION1_ADDR_END_V  0xFFFFFFFFU
#define LP_APM_REGION1_ADDR_END_S  0

/** LP_APM_REGION1_ATTR_REG register
 *  Region access authority attribute register
 */
#define LP_APM_REGION1_ATTR_REG (DR_REG_LP_APM_BASE + 0x18)
/** LP_APM_REGION1_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 1.
 */
#define LP_APM_REGION1_R0_X    (BIT(0))
#define LP_APM_REGION1_R0_X_M  (LP_APM_REGION1_R0_X_V << LP_APM_REGION1_R0_X_S)
#define LP_APM_REGION1_R0_X_V  0x00000001U
#define LP_APM_REGION1_R0_X_S  0
/** LP_APM_REGION1_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 1.
 */
#define LP_APM_REGION1_R0_W    (BIT(1))
#define LP_APM_REGION1_R0_W_M  (LP_APM_REGION1_R0_W_V << LP_APM_REGION1_R0_W_S)
#define LP_APM_REGION1_R0_W_V  0x00000001U
#define LP_APM_REGION1_R0_W_S  1
/** LP_APM_REGION1_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 1.
 */
#define LP_APM_REGION1_R0_R    (BIT(2))
#define LP_APM_REGION1_R0_R_M  (LP_APM_REGION1_R0_R_V << LP_APM_REGION1_R0_R_S)
#define LP_APM_REGION1_R0_R_V  0x00000001U
#define LP_APM_REGION1_R0_R_S  2
/** LP_APM_REGION1_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 1.
 */
#define LP_APM_REGION1_R1_X    (BIT(4))
#define LP_APM_REGION1_R1_X_M  (LP_APM_REGION1_R1_X_V << LP_APM_REGION1_R1_X_S)
#define LP_APM_REGION1_R1_X_V  0x00000001U
#define LP_APM_REGION1_R1_X_S  4
/** LP_APM_REGION1_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 1.
 */
#define LP_APM_REGION1_R1_W    (BIT(5))
#define LP_APM_REGION1_R1_W_M  (LP_APM_REGION1_R1_W_V << LP_APM_REGION1_R1_W_S)
#define LP_APM_REGION1_R1_W_V  0x00000001U
#define LP_APM_REGION1_R1_W_S  5
/** LP_APM_REGION1_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 1.
 */
#define LP_APM_REGION1_R1_R    (BIT(6))
#define LP_APM_REGION1_R1_R_M  (LP_APM_REGION1_R1_R_V << LP_APM_REGION1_R1_R_S)
#define LP_APM_REGION1_R1_R_V  0x00000001U
#define LP_APM_REGION1_R1_R_S  6
/** LP_APM_REGION1_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 1.
 */
#define LP_APM_REGION1_R2_X    (BIT(8))
#define LP_APM_REGION1_R2_X_M  (LP_APM_REGION1_R2_X_V << LP_APM_REGION1_R2_X_S)
#define LP_APM_REGION1_R2_X_V  0x00000001U
#define LP_APM_REGION1_R2_X_S  8
/** LP_APM_REGION1_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 1.
 */
#define LP_APM_REGION1_R2_W    (BIT(9))
#define LP_APM_REGION1_R2_W_M  (LP_APM_REGION1_R2_W_V << LP_APM_REGION1_R2_W_S)
#define LP_APM_REGION1_R2_W_V  0x00000001U
#define LP_APM_REGION1_R2_W_S  9
/** LP_APM_REGION1_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 1.
 */
#define LP_APM_REGION1_R2_R    (BIT(10))
#define LP_APM_REGION1_R2_R_M  (LP_APM_REGION1_R2_R_V << LP_APM_REGION1_R2_R_S)
#define LP_APM_REGION1_R2_R_V  0x00000001U
#define LP_APM_REGION1_R2_R_S  10
/** LP_APM_REGION1_TEE_X : R/W; bitpos: [12]; default: 1;
 *  Configures the execution authority of TEE_MODE in region 1.
 */
#define LP_APM_REGION1_TEE_X    (BIT(12))
#define LP_APM_REGION1_TEE_X_M  (LP_APM_REGION1_TEE_X_V << LP_APM_REGION1_TEE_X_S)
#define LP_APM_REGION1_TEE_X_V  0x00000001U
#define LP_APM_REGION1_TEE_X_S  12
/** LP_APM_REGION1_TEE_W : R/W; bitpos: [13]; default: 1;
 *  Configures the write authority of TEE_MODE in region 1.
 */
#define LP_APM_REGION1_TEE_W    (BIT(13))
#define LP_APM_REGION1_TEE_W_M  (LP_APM_REGION1_TEE_W_V << LP_APM_REGION1_TEE_W_S)
#define LP_APM_REGION1_TEE_W_V  0x00000001U
#define LP_APM_REGION1_TEE_W_S  13
/** LP_APM_REGION1_TEE_R : R/W; bitpos: [14]; default: 1;
 *  Configures the read authority of TEE_MODE in region 1.
 */
#define LP_APM_REGION1_TEE_R    (BIT(14))
#define LP_APM_REGION1_TEE_R_M  (LP_APM_REGION1_TEE_R_V << LP_APM_REGION1_TEE_R_S)
#define LP_APM_REGION1_TEE_R_V  0x00000001U
#define LP_APM_REGION1_TEE_R_S  14
/** LP_APM_REGION1_LOCK : R/W; bitpos: [16]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define LP_APM_REGION1_LOCK    (BIT(16))
#define LP_APM_REGION1_LOCK_M  (LP_APM_REGION1_LOCK_V << LP_APM_REGION1_LOCK_S)
#define LP_APM_REGION1_LOCK_V  0x00000001U
#define LP_APM_REGION1_LOCK_S  16

/** LP_APM_REGION2_ADDR_START_REG register
 *  Region address register
 */
#define LP_APM_REGION2_ADDR_START_REG (DR_REG_LP_APM_BASE + 0x1c)
/** LP_APM_REGION2_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures start address of region 2
 */
#define LP_APM_REGION2_ADDR_START    0xFFFFFFFFU
#define LP_APM_REGION2_ADDR_START_M  (LP_APM_REGION2_ADDR_START_V << LP_APM_REGION2_ADDR_START_S)
#define LP_APM_REGION2_ADDR_START_V  0xFFFFFFFFU
#define LP_APM_REGION2_ADDR_START_S  0

/** LP_APM_REGION2_ADDR_END_REG register
 *  Region address register
 */
#define LP_APM_REGION2_ADDR_END_REG (DR_REG_LP_APM_BASE + 0x20)
/** LP_APM_REGION2_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures end address of region 2
 */
#define LP_APM_REGION2_ADDR_END    0xFFFFFFFFU
#define LP_APM_REGION2_ADDR_END_M  (LP_APM_REGION2_ADDR_END_V << LP_APM_REGION2_ADDR_END_S)
#define LP_APM_REGION2_ADDR_END_V  0xFFFFFFFFU
#define LP_APM_REGION2_ADDR_END_S  0

/** LP_APM_REGION2_ATTR_REG register
 *  Region access authority attribute register
 */
#define LP_APM_REGION2_ATTR_REG (DR_REG_LP_APM_BASE + 0x24)
/** LP_APM_REGION2_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 2.
 */
#define LP_APM_REGION2_R0_X    (BIT(0))
#define LP_APM_REGION2_R0_X_M  (LP_APM_REGION2_R0_X_V << LP_APM_REGION2_R0_X_S)
#define LP_APM_REGION2_R0_X_V  0x00000001U
#define LP_APM_REGION2_R0_X_S  0
/** LP_APM_REGION2_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 2.
 */
#define LP_APM_REGION2_R0_W    (BIT(1))
#define LP_APM_REGION2_R0_W_M  (LP_APM_REGION2_R0_W_V << LP_APM_REGION2_R0_W_S)
#define LP_APM_REGION2_R0_W_V  0x00000001U
#define LP_APM_REGION2_R0_W_S  1
/** LP_APM_REGION2_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 2.
 */
#define LP_APM_REGION2_R0_R    (BIT(2))
#define LP_APM_REGION2_R0_R_M  (LP_APM_REGION2_R0_R_V << LP_APM_REGION2_R0_R_S)
#define LP_APM_REGION2_R0_R_V  0x00000001U
#define LP_APM_REGION2_R0_R_S  2
/** LP_APM_REGION2_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 2.
 */
#define LP_APM_REGION2_R1_X    (BIT(4))
#define LP_APM_REGION2_R1_X_M  (LP_APM_REGION2_R1_X_V << LP_APM_REGION2_R1_X_S)
#define LP_APM_REGION2_R1_X_V  0x00000001U
#define LP_APM_REGION2_R1_X_S  4
/** LP_APM_REGION2_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 2.
 */
#define LP_APM_REGION2_R1_W    (BIT(5))
#define LP_APM_REGION2_R1_W_M  (LP_APM_REGION2_R1_W_V << LP_APM_REGION2_R1_W_S)
#define LP_APM_REGION2_R1_W_V  0x00000001U
#define LP_APM_REGION2_R1_W_S  5
/** LP_APM_REGION2_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 2.
 */
#define LP_APM_REGION2_R1_R    (BIT(6))
#define LP_APM_REGION2_R1_R_M  (LP_APM_REGION2_R1_R_V << LP_APM_REGION2_R1_R_S)
#define LP_APM_REGION2_R1_R_V  0x00000001U
#define LP_APM_REGION2_R1_R_S  6
/** LP_APM_REGION2_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 2.
 */
#define LP_APM_REGION2_R2_X    (BIT(8))
#define LP_APM_REGION2_R2_X_M  (LP_APM_REGION2_R2_X_V << LP_APM_REGION2_R2_X_S)
#define LP_APM_REGION2_R2_X_V  0x00000001U
#define LP_APM_REGION2_R2_X_S  8
/** LP_APM_REGION2_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 2.
 */
#define LP_APM_REGION2_R2_W    (BIT(9))
#define LP_APM_REGION2_R2_W_M  (LP_APM_REGION2_R2_W_V << LP_APM_REGION2_R2_W_S)
#define LP_APM_REGION2_R2_W_V  0x00000001U
#define LP_APM_REGION2_R2_W_S  9
/** LP_APM_REGION2_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 2.
 */
#define LP_APM_REGION2_R2_R    (BIT(10))
#define LP_APM_REGION2_R2_R_M  (LP_APM_REGION2_R2_R_V << LP_APM_REGION2_R2_R_S)
#define LP_APM_REGION2_R2_R_V  0x00000001U
#define LP_APM_REGION2_R2_R_S  10
/** LP_APM_REGION2_TEE_X : R/W; bitpos: [12]; default: 1;
 *  Configures the execution authority of TEE_MODE in region 2.
 */
#define LP_APM_REGION2_TEE_X    (BIT(12))
#define LP_APM_REGION2_TEE_X_M  (LP_APM_REGION2_TEE_X_V << LP_APM_REGION2_TEE_X_S)
#define LP_APM_REGION2_TEE_X_V  0x00000001U
#define LP_APM_REGION2_TEE_X_S  12
/** LP_APM_REGION2_TEE_W : R/W; bitpos: [13]; default: 1;
 *  Configures the write authority of TEE_MODE in region 2.
 */
#define LP_APM_REGION2_TEE_W    (BIT(13))
#define LP_APM_REGION2_TEE_W_M  (LP_APM_REGION2_TEE_W_V << LP_APM_REGION2_TEE_W_S)
#define LP_APM_REGION2_TEE_W_V  0x00000001U
#define LP_APM_REGION2_TEE_W_S  13
/** LP_APM_REGION2_TEE_R : R/W; bitpos: [14]; default: 1;
 *  Configures the read authority of TEE_MODE in region 2.
 */
#define LP_APM_REGION2_TEE_R    (BIT(14))
#define LP_APM_REGION2_TEE_R_M  (LP_APM_REGION2_TEE_R_V << LP_APM_REGION2_TEE_R_S)
#define LP_APM_REGION2_TEE_R_V  0x00000001U
#define LP_APM_REGION2_TEE_R_S  14
/** LP_APM_REGION2_LOCK : R/W; bitpos: [16]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define LP_APM_REGION2_LOCK    (BIT(16))
#define LP_APM_REGION2_LOCK_M  (LP_APM_REGION2_LOCK_V << LP_APM_REGION2_LOCK_S)
#define LP_APM_REGION2_LOCK_V  0x00000001U
#define LP_APM_REGION2_LOCK_S  16

/** LP_APM_REGION3_ADDR_START_REG register
 *  Region address register
 */
#define LP_APM_REGION3_ADDR_START_REG (DR_REG_LP_APM_BASE + 0x28)
/** LP_APM_REGION3_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures start address of region 3
 */
#define LP_APM_REGION3_ADDR_START    0xFFFFFFFFU
#define LP_APM_REGION3_ADDR_START_M  (LP_APM_REGION3_ADDR_START_V << LP_APM_REGION3_ADDR_START_S)
#define LP_APM_REGION3_ADDR_START_V  0xFFFFFFFFU
#define LP_APM_REGION3_ADDR_START_S  0

/** LP_APM_REGION3_ADDR_END_REG register
 *  Region address register
 */
#define LP_APM_REGION3_ADDR_END_REG (DR_REG_LP_APM_BASE + 0x2c)
/** LP_APM_REGION3_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures end address of region 3
 */
#define LP_APM_REGION3_ADDR_END    0xFFFFFFFFU
#define LP_APM_REGION3_ADDR_END_M  (LP_APM_REGION3_ADDR_END_V << LP_APM_REGION3_ADDR_END_S)
#define LP_APM_REGION3_ADDR_END_V  0xFFFFFFFFU
#define LP_APM_REGION3_ADDR_END_S  0

/** LP_APM_REGION3_ATTR_REG register
 *  Region access authority attribute register
 */
#define LP_APM_REGION3_ATTR_REG (DR_REG_LP_APM_BASE + 0x30)
/** LP_APM_REGION3_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 3.
 */
#define LP_APM_REGION3_R0_X    (BIT(0))
#define LP_APM_REGION3_R0_X_M  (LP_APM_REGION3_R0_X_V << LP_APM_REGION3_R0_X_S)
#define LP_APM_REGION3_R0_X_V  0x00000001U
#define LP_APM_REGION3_R0_X_S  0
/** LP_APM_REGION3_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 3.
 */
#define LP_APM_REGION3_R0_W    (BIT(1))
#define LP_APM_REGION3_R0_W_M  (LP_APM_REGION3_R0_W_V << LP_APM_REGION3_R0_W_S)
#define LP_APM_REGION3_R0_W_V  0x00000001U
#define LP_APM_REGION3_R0_W_S  1
/** LP_APM_REGION3_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 3.
 */
#define LP_APM_REGION3_R0_R    (BIT(2))
#define LP_APM_REGION3_R0_R_M  (LP_APM_REGION3_R0_R_V << LP_APM_REGION3_R0_R_S)
#define LP_APM_REGION3_R0_R_V  0x00000001U
#define LP_APM_REGION3_R0_R_S  2
/** LP_APM_REGION3_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 3.
 */
#define LP_APM_REGION3_R1_X    (BIT(4))
#define LP_APM_REGION3_R1_X_M  (LP_APM_REGION3_R1_X_V << LP_APM_REGION3_R1_X_S)
#define LP_APM_REGION3_R1_X_V  0x00000001U
#define LP_APM_REGION3_R1_X_S  4
/** LP_APM_REGION3_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 3.
 */
#define LP_APM_REGION3_R1_W    (BIT(5))
#define LP_APM_REGION3_R1_W_M  (LP_APM_REGION3_R1_W_V << LP_APM_REGION3_R1_W_S)
#define LP_APM_REGION3_R1_W_V  0x00000001U
#define LP_APM_REGION3_R1_W_S  5
/** LP_APM_REGION3_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 3.
 */
#define LP_APM_REGION3_R1_R    (BIT(6))
#define LP_APM_REGION3_R1_R_M  (LP_APM_REGION3_R1_R_V << LP_APM_REGION3_R1_R_S)
#define LP_APM_REGION3_R1_R_V  0x00000001U
#define LP_APM_REGION3_R1_R_S  6
/** LP_APM_REGION3_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 3.
 */
#define LP_APM_REGION3_R2_X    (BIT(8))
#define LP_APM_REGION3_R2_X_M  (LP_APM_REGION3_R2_X_V << LP_APM_REGION3_R2_X_S)
#define LP_APM_REGION3_R2_X_V  0x00000001U
#define LP_APM_REGION3_R2_X_S  8
/** LP_APM_REGION3_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 3.
 */
#define LP_APM_REGION3_R2_W    (BIT(9))
#define LP_APM_REGION3_R2_W_M  (LP_APM_REGION3_R2_W_V << LP_APM_REGION3_R2_W_S)
#define LP_APM_REGION3_R2_W_V  0x00000001U
#define LP_APM_REGION3_R2_W_S  9
/** LP_APM_REGION3_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 3.
 */
#define LP_APM_REGION3_R2_R    (BIT(10))
#define LP_APM_REGION3_R2_R_M  (LP_APM_REGION3_R2_R_V << LP_APM_REGION3_R2_R_S)
#define LP_APM_REGION3_R2_R_V  0x00000001U
#define LP_APM_REGION3_R2_R_S  10
/** LP_APM_REGION3_TEE_X : R/W; bitpos: [12]; default: 1;
 *  Configures the execution authority of TEE_MODE in region 3.
 */
#define LP_APM_REGION3_TEE_X    (BIT(12))
#define LP_APM_REGION3_TEE_X_M  (LP_APM_REGION3_TEE_X_V << LP_APM_REGION3_TEE_X_S)
#define LP_APM_REGION3_TEE_X_V  0x00000001U
#define LP_APM_REGION3_TEE_X_S  12
/** LP_APM_REGION3_TEE_W : R/W; bitpos: [13]; default: 1;
 *  Configures the write authority of TEE_MODE in region 3.
 */
#define LP_APM_REGION3_TEE_W    (BIT(13))
#define LP_APM_REGION3_TEE_W_M  (LP_APM_REGION3_TEE_W_V << LP_APM_REGION3_TEE_W_S)
#define LP_APM_REGION3_TEE_W_V  0x00000001U
#define LP_APM_REGION3_TEE_W_S  13
/** LP_APM_REGION3_TEE_R : R/W; bitpos: [14]; default: 1;
 *  Configures the read authority of TEE_MODE in region 3.
 */
#define LP_APM_REGION3_TEE_R    (BIT(14))
#define LP_APM_REGION3_TEE_R_M  (LP_APM_REGION3_TEE_R_V << LP_APM_REGION3_TEE_R_S)
#define LP_APM_REGION3_TEE_R_V  0x00000001U
#define LP_APM_REGION3_TEE_R_S  14
/** LP_APM_REGION3_LOCK : R/W; bitpos: [16]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define LP_APM_REGION3_LOCK    (BIT(16))
#define LP_APM_REGION3_LOCK_M  (LP_APM_REGION3_LOCK_V << LP_APM_REGION3_LOCK_S)
#define LP_APM_REGION3_LOCK_V  0x00000001U
#define LP_APM_REGION3_LOCK_S  16

/** LP_APM_REGION4_ADDR_START_REG register
 *  Region address register
 */
#define LP_APM_REGION4_ADDR_START_REG (DR_REG_LP_APM_BASE + 0x34)
/** LP_APM_REGION4_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures start address of region 4
 */
#define LP_APM_REGION4_ADDR_START    0xFFFFFFFFU
#define LP_APM_REGION4_ADDR_START_M  (LP_APM_REGION4_ADDR_START_V << LP_APM_REGION4_ADDR_START_S)
#define LP_APM_REGION4_ADDR_START_V  0xFFFFFFFFU
#define LP_APM_REGION4_ADDR_START_S  0

/** LP_APM_REGION4_ADDR_END_REG register
 *  Region address register
 */
#define LP_APM_REGION4_ADDR_END_REG (DR_REG_LP_APM_BASE + 0x38)
/** LP_APM_REGION4_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures end address of region 4
 */
#define LP_APM_REGION4_ADDR_END    0xFFFFFFFFU
#define LP_APM_REGION4_ADDR_END_M  (LP_APM_REGION4_ADDR_END_V << LP_APM_REGION4_ADDR_END_S)
#define LP_APM_REGION4_ADDR_END_V  0xFFFFFFFFU
#define LP_APM_REGION4_ADDR_END_S  0

