espressif/esp-idf/components/soc/esp32s31/register/soc/lp_apm_reg.h
/** LP_APM_M1_STATUS_REG register
 *  M1 status register
 */
#define LP_APM_M1_STATUS_REG (DR_REG_LP_APM_BASE + 0xd4)
/** LP_APM_M1_EXCEPTION_STATUS : RO; bitpos: [1:0]; default: 0;
 *  Represents exception status.
 *  bit0: 1 represents authority_exception
 *  bit1: 1 represents space_exception
 */
#define LP_APM_M1_EXCEPTION_STATUS    0x00000003U
#define LP_APM_M1_EXCEPTION_STATUS_M  (LP_APM_M1_EXCEPTION_STATUS_V << LP_APM_M1_EXCEPTION_STATUS_S)
#define LP_APM_M1_EXCEPTION_STATUS_V  0x00000003U
#define LP_APM_M1_EXCEPTION_STATUS_S  0

/** LP_APM_M1_STATUS_CLR_REG register
 *  M1 status clear register
 */
#define LP_APM_M1_STATUS_CLR_REG (DR_REG_LP_APM_BASE + 0xd8)
/** LP_APM_M1_EXCEPTION_STATUS_CLR : WT; bitpos: [0]; default: 0;
 *  Configures to clear exception status
 */
#define LP_APM_M1_EXCEPTION_STATUS_CLR    (BIT(0))
#define LP_APM_M1_EXCEPTION_STATUS_CLR_M  (LP_APM_M1_EXCEPTION_STATUS_CLR_V << LP_APM_M1_EXCEPTION_STATUS_CLR_S)
#define LP_APM_M1_EXCEPTION_STATUS_CLR_V  0x00000001U
#define LP_APM_M1_EXCEPTION_STATUS_CLR_S  0

/** LP_APM_M1_EXCEPTION_INFO0_REG register
 *  M1 exception_info0 register
 */
#define LP_APM_M1_EXCEPTION_INFO0_REG (DR_REG_LP_APM_BASE + 0xdc)
/** LP_APM_M1_EXCEPTION_REGION : RO; bitpos: [7:0]; default: 0;
 *  Represents exception region
 */
#define LP_APM_M1_EXCEPTION_REGION    0x000000FFU
#define LP_APM_M1_EXCEPTION_REGION_M  (LP_APM_M1_EXCEPTION_REGION_V << LP_APM_M1_EXCEPTION_REGION_S)
#define LP_APM_M1_EXCEPTION_REGION_V  0x000000FFU
#define LP_APM_M1_EXCEPTION_REGION_S  0
/** LP_APM_M1_EXCEPTION_MODE : RO; bitpos: [17:16]; default: 0;
 *  Represents exception mode
 */
#define LP_APM_M1_EXCEPTION_MODE    0x00000003U
#define LP_APM_M1_EXCEPTION_MODE_M  (LP_APM_M1_EXCEPTION_MODE_V << LP_APM_M1_EXCEPTION_MODE_S)
#define LP_APM_M1_EXCEPTION_MODE_V  0x00000003U
#define LP_APM_M1_EXCEPTION_MODE_S  16
/** LP_APM_M1_EXCEPTION_ID : RO; bitpos: [23:18]; default: 0;
 *  Represents exception id information
 */
#define LP_APM_M1_EXCEPTION_ID    0x0000003FU
#define LP_APM_M1_EXCEPTION_ID_M  (LP_APM_M1_EXCEPTION_ID_V << LP_APM_M1_EXCEPTION_ID_S)
#define LP_APM_M1_EXCEPTION_ID_V  0x0000003FU
#define LP_APM_M1_EXCEPTION_ID_S  18

/** LP_APM_M1_EXCEPTION_INFO1_REG register
 *  M1 exception_info1 register
 */
#define LP_APM_M1_EXCEPTION_INFO1_REG (DR_REG_LP_APM_BASE + 0xe0)
/** LP_APM_M1_EXCEPTION_ADDR : RO; bitpos: [31:0]; default: 0;
 *  Represents exception addr
 */
#define LP_APM_M1_EXCEPTION_ADDR    0xFFFFFFFFU
#define LP_APM_M1_EXCEPTION_ADDR_M  (LP_APM_M1_EXCEPTION_ADDR_V << LP_APM_M1_EXCEPTION_ADDR_S)
#define LP_APM_M1_EXCEPTION_ADDR_V  0xFFFFFFFFU
#define LP_APM_M1_EXCEPTION_ADDR_S  0

/** LP_APM_M2_STATUS_REG register
 *  M2 status register
 */
#define LP_APM_M2_STATUS_REG (DR_REG_LP_APM_BASE + 0xe8)
/** LP_APM_M2_EXCEPTION_STATUS : RO; bitpos: [1:0]; default: 0;
 *  Represents exception status.
 *  bit0: 1 represents authority_exception
 *  bit1: 1 represents space_exception
 */
#define LP_APM_M2_EXCEPTION_STATUS    0x00000003U
#define LP_APM_M2_EXCEPTION_STATUS_M  (LP_APM_M2_EXCEPTION_STATUS_V << LP_APM_M2_EXCEPTION_STATUS_S)
#define LP_APM_M2_EXCEPTION_STATUS_V  0x00000003U
#define LP_APM_M2_EXCEPTION_STATUS_S  0

/** LP_APM_M2_STATUS_CLR_REG register
 *  M2 status clear register
 */
#define LP_APM_M2_STATUS_CLR_REG (DR_REG_LP_APM_BASE + 0xec)
/** LP_APM_M2_EXCEPTION_STATUS_CLR : WT; bitpos: [0]; default: 0;
 *  Configures to clear exception status
 */
#define LP_APM_M2_EXCEPTION_STATUS_CLR    (BIT(0))
#define LP_APM_M2_EXCEPTION_STATUS_CLR_M  (LP_APM_M2_EXCEPTION_STATUS_CLR_V << LP_APM_M2_EXCEPTION_STATUS_CLR_S)
#define LP_APM_M2_EXCEPTION_STATUS_CLR_V  0x00000001U
#define LP_APM_M2_EXCEPTION_STATUS_CLR_S  0

/** LP_APM_M2_EXCEPTION_INFO0_REG register
 *  M2 exception_info0 register
 */
#define LP_APM_M2_EXCEPTION_INFO0_REG (DR_REG_LP_APM_BASE + 0xf0)
/** LP_APM_M2_EXCEPTION_REGION : RO; bitpos: [7:0]; default: 0;
 *  Represents exception region
 */
#define LP_APM_M2_EXCEPTION_REGION    0x000000FFU
#define LP_APM_M2_EXCEPTION_REGION_M  (LP_APM_M2_EXCEPTION_REGION_V << LP_APM_M2_EXCEPTION_REGION_S)
#define LP_APM_M2_EXCEPTION_REGION_V  0x000000FFU
#define LP_APM_M2_EXCEPTION_REGION_S  0
/** LP_APM_M2_EXCEPTION_MODE : RO; bitpos: [17:16]; default: 0;
 *  Represents exception mode
 */
#define LP_APM_M2_EXCEPTION_MODE    0x00000003U
#define LP_APM_M2_EXCEPTION_MODE_M  (LP_APM_M2_EXCEPTION_MODE_V << LP_APM_M2_EXCEPTION_MODE_S)
#define LP_APM_M2_EXCEPTION_MODE_V  0x00000003U
#define LP_APM_M2_EXCEPTION_MODE_S  16
/** LP_APM_M2_EXCEPTION_ID : RO; bitpos: [23:18]; default: 0;
 *  Represents exception id information
 */
#define LP_APM_M2_EXCEPTION_ID    0x0000003FU
#define LP_APM_M2_EXCEPTION_ID_M  (LP_APM_M2_EXCEPTION_ID_V << LP_APM_M2_EXCEPTION_ID_S)
#define LP_APM_M2_EXCEPTION_ID_V  0x0000003FU
#define LP_APM_M2_EXCEPTION_ID_S  18

/** LP_APM_M2_EXCEPTION_INFO1_REG register
 *  M2 exception_info1 register
 */
#define LP_APM_M2_EXCEPTION_INFO1_REG (DR_REG_LP_APM_BASE + 0xf4)
/** LP_APM_M2_EXCEPTION_ADDR : RO; bitpos: [31:0]; default: 0;
 *  Represents exception addr
 */
#define LP_APM_M2_EXCEPTION_ADDR    0xFFFFFFFFU
#define LP_APM_M2_EXCEPTION_ADDR_M  (LP_APM_M2_EXCEPTION_ADDR_V << LP_APM_M2_EXCEPTION_ADDR_S)
#define LP_APM_M2_EXCEPTION_ADDR_V  0xFFFFFFFFU
#define LP_APM_M2_EXCEPTION_ADDR_S  0

/** LP_APM_M3_STATUS_REG register
 *  M3 status register
 */
#define LP_APM_M3_STATUS_REG (DR_REG_LP_APM_BASE + 0xfc)
/** LP_APM_M3_EXCEPTION_STATUS : RO; bitpos: [1:0]; default: 0;
 *  Represents exception status.
 *  bit0: 1 represents authority_exception
 *  bit1: 1 represents space_exception
 */
#define LP_APM_M3_EXCEPTION_STATUS    0x00000003U
#define LP_APM_M3_EXCEPTION_STATUS_M  (LP_APM_M3_EXCEPTION_STATUS_V << LP_APM_M3_EXCEPTION_STATUS_S)
#define LP_APM_M3_EXCEPTION_STATUS_V  0x00000003U
#define LP_APM_M3_EXCEPTION_STATUS_S  0

/** LP_APM_M3_STATUS_CLR_REG register
 *  M3 status clear register
 */
#define LP_APM_M3_STATUS_CLR_REG (DR_REG_LP_APM_BASE + 0x100)
/** LP_APM_M3_EXCEPTION_STATUS_CLR : WT; bitpos: [0]; default: 0;
 *  Configures to clear exception status
 */
#define LP_APM_M3_EXCEPTION_STATUS_CLR    (BIT(0))
#define LP_APM_M3_EXCEPTION_STATUS_CLR_M  (LP_APM_M3_EXCEPTION_STATUS_CLR_V << LP_APM_M3_EXCEPTION_STATUS_CLR_S)
#define LP_APM_M3_EXCEPTION_STATUS_CLR_V  0x00000001U
#define LP_APM_M3_EXCEPTION_STATUS_CLR_S  0

/** LP_APM_M3_EXCEPTION_INFO0_REG register
 *  M3 exception_info0 register
 */
#define LP_APM_M3_EXCEPTION_INFO0_REG (DR_REG_LP_APM_BASE + 0x104)
/** LP_APM_M3_EXCEPTION_REGION : RO; bitpos: [7:0]; default: 0;
 *  Represents exception region
 */
#define LP_APM_M3_EXCEPTION_REGION    0x000000FFU
#define LP_APM_M3_EXCEPTION_REGION_M  (LP_APM_M3_EXCEPTION_REGION_V << LP_APM_M3_EXCEPTION_REGION_S)
#define LP_APM_M3_EXCEPTION_REGION_V  0x000000FFU
#define LP_APM_M3_EXCEPTION_REGION_S  0
/** LP_APM_M3_EXCEPTION_MODE : RO; bitpos: [17:16]; default: 0;
 *  Represents exception mode
 */
#define LP_APM_M3_EXCEPTION_MODE    0x00000003U
#define LP_APM_M3_EXCEPTION_MODE_M  (LP_APM_M3_EXCEPTION_MODE_V << LP_APM_M3_EXCEPTION_MODE_S)
#define LP_APM_M3_EXCEPTION_MODE_V  0x00000003U
#define LP_APM_M3_EXCEPTION_MODE_S  16
/** LP_APM_M3_EXCEPTION_ID : RO; bitpos: [23:18]; default: 0;
 *  Represents exception id information
 */
#define LP_APM_M3_EXCEPTION_ID    0x0000003FU
#define LP_APM_M3_EXCEPTION_ID_M  (LP_APM_M3_EXCEPTION_ID_V << LP_APM_M3_EXCEPTION_ID_S)
#define LP_APM_M3_EXCEPTION_ID_V  0x0000003FU
#define LP_APM_M3_EXCEPTION_ID_S  18

/** LP_APM_M3_EXCEPTION_INFO1_REG register
 *  M3 exception_info1 register
 */
#define LP_APM_M3_EXCEPTION_INFO1_REG (DR_REG_LP_APM_BASE + 0x108)
/** LP_APM_M3_EXCEPTION_ADDR : RO; bitpos: [31:0]; default: 0;
 *  Represents exception addr
 */
#define LP_APM_M3_EXCEPTION_ADDR    0xFFFFFFFFU
#define LP_APM_M3_EXCEPTION_ADDR_M  (LP_APM_M3_EXCEPTION_ADDR_V << LP_APM_M3_EXCEPTION_ADDR_S)
#define LP_APM_M3_EXCEPTION_ADDR_V  0xFFFFFFFFU
#define LP_APM_M3_EXCEPTION_ADDR_S  0

/** LP_APM_INT_EN_REG register
 *  APM interrupt enable register
 */
#define LP_APM_INT_EN_REG (DR_REG_LP_APM_BASE + 0x10c)
/** LP_APM_M0_APM_INT_EN : R/W; bitpos: [0]; default: 0;
 *  Configures APM M0 interrupt enable.
 *  0: disable
 *  1: enable
 */
#define LP_APM_M0_APM_INT_EN    (BIT(0))
#define LP_APM_M0_APM_INT_EN_M  (LP_APM_M0_APM_INT_EN_V << LP_APM_M0_APM_INT_EN_S)
#define LP_APM_M0_APM_INT_EN_V  0x00000001U
#define LP_APM_M0_APM_INT_EN_S  0
/** LP_APM_M1_APM_INT_EN : R/W; bitpos: [1]; default: 0;
 *  Configures APM M1 interrupt enable.
 *  0: disable
 *  1: enable
 */
#define LP_APM_M1_APM_INT_EN    (BIT(1))
#define LP_APM_M1_APM_INT_EN_M  (LP_APM_M1_APM_INT_EN_V << LP_APM_M1_APM_INT_EN_S)
#define LP_APM_M1_APM_INT_EN_V  0x00000001U
#define LP_APM_M1_APM_INT_EN_S  1
/** LP_APM_M2_APM_INT_EN : R/W; bitpos: [2]; default: 0;
 *  Configures APM M2 interrupt enable.
 *  0: disable
 *  1: enable
 */
#define LP_APM_M2_APM_INT_EN    (BIT(2))
#define LP_APM_M2_APM_INT_EN_M  (LP_APM_M2_APM_INT_EN_V << LP_APM_M2_APM_INT_EN_S)
#define LP_APM_M2_APM_INT_EN_V  0x00000001U
#define LP_APM_M2_APM_INT_EN_S  2
/** LP_APM_M3_APM_INT_EN : R/W; bitpos: [3]; default: 0;
 *  Configures APM M3 interrupt enable.
 *  0: disable
 *  1: enable
 */
#define LP_APM_M3_APM_INT_EN    (BIT(3))
#define LP_APM_M3_APM_INT_EN_M  (LP_APM_M3_APM_INT_EN_V << LP_APM_M3_APM_INT_EN_S)
#define LP_APM_M3_APM_INT_EN_V  0x00000001U
#define LP_APM_M3_APM_INT_EN_S  3

/** LP_APM_BUS_ERR_CONF_REG register
 *  APM interrupt enable register
 */
#define LP_APM_BUS_ERR_CONF_REG (DR_REG_LP_APM_BASE + 0x110)
/** LP_APM_BUS_ERR_RESP_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether return error response to cpu when access blocked
 *  0: disable error response
 *  1: enable error response
 */
#define LP_APM_BUS_ERR_RESP_EN    (BIT(0))
#define LP_APM_BUS_ERR_RESP_EN_M  (LP_APM_BUS_ERR_RESP_EN_V << LP_APM_BUS_ERR_RESP_EN_S)
#define LP_APM_BUS_ERR_RESP_EN_V  0x00000001U
#define LP_APM_BUS_ERR_RESP_EN_S  0

/** LP_APM_CLOCK_GATE_REG register
 *  Clock gating register
 */
#define LP_APM_CLOCK_GATE_REG (DR_REG_LP_APM_BASE + 0x3f8)
/** LP_APM_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Configures whether to keep the clock always on.
 *  0: enable automatic clock gating
 *  1: keep the clock always on
 */
#define LP_APM_CLK_EN    (BIT(0))
#define LP_APM_CLK_EN_M  (LP_APM_CLK_EN_V << LP_APM_CLK_EN_S)
#define LP_APM_CLK_EN_V  0x00000001U
#define LP_APM_CLK_EN_S  0

/** LP_APM_DATE_REG register
 *  Version control register
 */
#define LP_APM_DATE_REG (DR_REG_LP_APM_BASE + 0x3fc)
/** LP_APM_DATE : R/W; bitpos: [27:0]; default: 38822496;
 *  Version control register
 */
#define LP_APM_DATE    0x0FFFFFFFU
#define LP_APM_DATE_M  (LP_APM_DATE_V << LP_APM_DATE_S)
#define LP_APM_DATE_V  0x0FFFFFFFU
#define LP_APM_DATE_S  0

#ifdef __cplusplus
}
#endif
